app/Models/SiswaModel.php

SELECT `nis`, `nisn`, `nama_siswa`, `tgl_diterima`, `dikelas`, `status_siswa`, `status_pd`, `slug`, `id`
FROM `tbl_siswa`
---
    public function getSpecificData()
    {
        return $this->select('nis, nisn, nama_siswa, tgl_diterima, dikelas, status_siswa, status_pd, slug, id')
            ->findAll();

SELECT *
FROM `tbl_siswa`
ORDER BY `id` DESC
 LIMIT 1
---
    public function getLastNis()
    {
        $latestRow = $this->orderBy('id', 'DESC')->first();

SELECT COUNT(*) AS `numrows`
FROM `tbl_siswa`
---
    public function getTotalSiswa()
    {
        return $this->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_siswa`
WHERE `jk` = 'Laki-laki'
---
    public function getJumlahSiswaByGender($gender)
    {
        return $this->where('jk', $gender)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_siswa`
WHERE YEAR(STR_TO_DATE(tgl_diterima, "%d/%m/%Y")) = '2023'
---
    public function getTotalSiswaByCurrentYear()
    {
        // Dapatkan tahun berjalan
        $currentYear = date('Y');

        // Hitung jumlah siswa yang tanggal_diterima-nya cocok dengan tahun berjalan
        return $this->where('YEAR(STR_TO_DATE(tgl_diterima, "%d/%m/%Y"))', $currentYear)->countAllResults();

SELECT DISTINCT YEAR(STR_TO_DATE(tgl_diterima, "%d/%m/%Y")) as year
FROM `tbl_siswa`
ORDER BY `year` ASC
---
    public function getUniqueYears()
    {
        $query = $this->select('YEAR(STR_TO_DATE(tgl_diterima, "%d/%m/%Y")) as year', false)
            ->distinct()
            ->orderBy('year', 'ASC') // Urutkan tahun secara menaik
            ->get();

SELECT `nisn`, `nama_siswa`, `tgl_diterima`, `dikelas`, `status_siswa`, `status_pd`, `slug`, `id`
FROM `tbl_siswa`
WHERE YEAR(STR_TO_DATE(tgl_diterima, "%d/%m/%Y"))
---
    public function getSiswaByYear($year)
    {
        return $this->select('nisn, nama_siswa, tgl_diterima, dikelas, status_siswa, status_pd, slug, id')
            ->where('YEAR(STR_TO_DATE(tgl_diterima, "%d/%m/%Y"))', $year)
            ->findAll();

SELECT `nis`, `nama_siswa`, `siswa_rombel`, `id`, `jk`
FROM `tbl_siswa`
---
    public function getGroupedSiswaByRombelWithGenderCount()
    {
        $siswaData = $this->select('nis, nama_siswa, siswa_rombel, id, jk')->findAll();