app/Models/UserModel.php

    public function get_data($username, $password)
    {
        return $this->db->table('tbl_user')
            ->where(array('user_nama' => $username, 'user_pass' => $password))
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `user_nama` = 'admin'
AND `user_pass` = 'admin'

    public function getUser()
    {
        return $this->findAll();
---
SELECT *
FROM `tbl_user`